app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "mario diz buh"], ["user_id", 6], ["post_id", 5], ["created_at", "2015-05-03 12:23:26.106679"], ["updated_at", "2015-05-03 12:23:26.106679"]]
---
	def create
	  post = Post.find(params[:post_id])
	  comment = post.comments.create(comment_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 2], ["id", 1]]
UPDATE "comments" SET "upvotes" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["upvotes", 1], ["updated_at", "2015-05-02 15:31:28.784126"], ["id", 1]]
---
	def upvote
	  post = Post.find(params[:post_id])
    comment = post.comments.find(params[:id])
    comment.increment!(:upvotes)