app/controllers/posts_controller.rb

	def index
	  respond_with Post.all
---
SELECT "posts".* FROM "posts"

	def create
	  respond_with Post.create(post_params)
---
INSERT INTO "posts" ("link", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["link", "https://www.facebook.com/"], ["title", "O maior Post de todos"], ["user_id", 5], ["created_at", "2015-05-03 12:22:41.784149"], ["updated_at", "2015-05-03 12:22:41.784149"]]

	def show
	  respond_with Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

	def upvote
	  post = Post.find(params[:id])
	  post.increment!(:upvotes)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "upvotes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["upvotes", 1], ["updated_at", "2015-05-02 15:06:49.501611"], ["id", 1]]